This tutorial explains how to join two tables A and B using edit distance measure. First, you need to import the required packages as follows (if you have installed **py_stringsimjoin** it will automatically install the dependencies **py_stringmatching** and **pandas**):

In [16]:
# Import libraries
import py_stringsimjoin as ssj
import py_stringmatching as sm
import pandas as pd
import os, sys

In [17]:
print('python version ' + sys.version)
print('py_stringsimjoin version: ' + ssj.__version__)
print('py_stringmatching version: ' + sm.__version__)
print('pandas version: ' + pd.__version__)

python version 2.7.10 |Anaconda 2.3.0 (64-bit)| (default, May 28 2015, 17:02:03)
[GCC 4.4.7 20120313 (Red Hat 4.4.7-1)]
py_stringsimjoin version: 0.1.0
py_stringmatching version: 0.1.0
pandas version: 0.16.2

Joining two tables using edit distance measure typically consists of 3 steps:
1. Loading the input tables
2. Profiling the tables
3. Performing join

# 1. Loading the input tables

We begin by loading two tables. For the purpose of this tutorial, 
we use the sample dataset that comes with the package.

In [18]:
table_A_path = os.sep.join([ssj.get_install_path(), 'datasets', 'data', 'table_A.csv'])
table_B_path = os.sep.join([ssj.get_install_path(), 'datasets', 'data', 'table_B.csv'])

In [19]:
# Load csv files as dataframes.
A = pd.read_csv(table_A_path)
B = pd.read_csv(table_B_path)
print('Number of records in A: ' + str(len(A)))
print('Number of records in B: ' + str(len(B)))

Number of records in A: 7
Number of records in B: 8

In [20]:
A

,A.id,A.name,A.birth_year,A.hourly_wage,A.address,A.zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122
5,a6,,1990,40.0,"24th Street, San Francisco",94122
6,a7,NaN,1986,25.0,"20th Street, San Francisco",NaN

In [21]:
B

,B.id,B.name,B.birth_year,B.hourly_wage,B.address,B.zipcode
0,b1,Mark Levene,1987,29.5,"108 Clement St, San Francisco",94107
1,b2,Bill Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
2,b3,Mike Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
3,b4,Joseph Kuan,1982,26.0,"108 South Park, San Francisco",94122
4,b5,Alfons Kemper,1984,35.0,"170 Post St, Apt 4, San Francisco",94122
5,b6,Michael Brodie,1987,32.5,"133 Clement Street, San Francisco",94107
6,b7,,1990,40.0,"24th Street, San Francisco",94122
7,b8,NaN,1986,25.0,"20th Street, San Francisco",NaN

# 2. Profiling the tables

Before performing the join we may want to know about the characteristics 
of the attributes such as number of missing values etc.,
which can affect the join output. Using the profiling command, we can inspect
the effect of missing values for each attribute. Further, we can identify
the attributes which contain unique values.

In [22]:
# profile attributes in table A
ssj.profile_table_for_join(A)

,Unique values,Missing values,Comments
Attribute,,,
A.id,7 (100.0%),0 (0.0%),This attribute can be used as a key attribute.
A.name,7 (100.0%),1 (14.29%),Joining on this attribute will ignore 1 (14.29%) rows.
A.birth_year,6 (85.71%),0 (0.0%),
A.hourly_wage,7 (100.0%),0 (0.0%),This attribute can be used as a key attribute.
A.address,7 (100.0%),0 (0.0%),This attribute can be used as a key attribute.
A.zipcode,3 (42.86%),1 (14.29%),Joining on this attribute will ignore 1 (14.29%) rows.

In [23]:
# profile attributes in table B
ssj.profile_table_for_join(B)

,Unique values,Missing values,Comments
Attribute,,,
B.id,8 (100.0%),0 (0.0%),This attribute can be used as a key attribute.
B.name,8 (100.0%),1 (12.5%),Joining on this attribute will ignore 1 (12.5%) rows.
B.birth_year,6 (75.0%),0 (0.0%),
B.hourly_wage,8 (100.0%),0 (0.0%),This attribute can be used as a key attribute.
B.address,8 (100.0%),0 (0.0%),This attribute can be used as a key attribute.
B.zipcode,3 (37.5%),1 (12.5%),Joining on this attribute will ignore 1 (12.5%) rows.

For the purpose of this tutorial, we will now join tables A and B on 
'name' attribute using Jaccard measure. Next, we need to decide on what 
threshold to use for the join. For this tutorial, we will use a threshold of 0.3. 
Specifically, the join will now find tuple pairs from A and B such that 
the Jaccard score over the 'name' attributes is atleast 0.3.

# 3. Performing join

The next step is to perform the join using the following command:

In [24]:
# find all pairs from A and B such that the edit distance
# on 'name' is at least 0.3.
# l_out_attrs and r_out_attrs denotes the attributes from the 
# left (A) and right (B) table that needs to be included in the output.
output_pairs = ssj.edit_distance_join(A, B, 'A.id', 'B.id', 'A.zipcode', 'B.zipcode', 1, 
                                      l_out_attrs=['A.zipcode'], r_out_attrs=['B.zipcode'])

0%    100%
[########] | ETA[sec]: 0.000
Total time elapsed: 0.006 sec

In [25]:
len(output_pairs)

23

In [26]:
# examine the output pairs
output_pairs

    _id l_A.id r_B.id l_A.zipcode r_B.zipcode  _sim_score
0     0     a1     b1     94107.0     94107.0           0
1     1     a3     b1     94107.0     94107.0           0
2     2     a1     b2     94107.0     94107.0           0
3     3     a3     b2     94107.0     94107.0           0
4     4     a2     b3     94122.0     94122.0           0
5     5     a4     b3     94122.0     94122.0           0
6     6     a5     b3     94122.0     94122.0           0
7     7     a6     b3     94122.0     94122.0           0
8     8     a2     b4     94122.0     94122.0           0
9     9     a4     b4     94122.0     94122.0           0
10   10     a5     b4     94122.0     94122.0           0
11   11     a6     b4     94122.0     94122.0           0
12   12     a2     b5     94122.0     94122.0           0
13   13     a4     b5     94122.0     94122.0           0
14   14     a5     b5     94122.0     94122.0           0
15   15     a6     b5     94122.0     94122.0           0
16   16     a1     b6     94107.0     94107.0           0
17   17     a3     b6     94107.0     94107.0           0
18   18     a2     b7     94122.0     94122.0           0
19   19     a4     b7     94122.0     94122.0           0
20   20     a5     b7     94122.0     94122.0           0
21   21     a6     b7     94122.0     94122.0           0
22   22     a7     b8         nan         nan           0

# Handling missing values

By default, pairs with missing values are not included
in the output. This is because a string with a missing value
can match with all strings in the other table and hence the
number of output pairs can become huge. If you want to include
pairs with missing value in the output, you need to set the
**allow_missing** flag to True, as shown below:

In [27]:
output_pairs = ssj.edit_distance_join(A, B, 'A.id', 'B.id', 'A.zipcode', 'B.zipcode', 1, allow_missing=True, 
                                      l_out_attrs=['A.zipcode'], r_out_attrs=['B.zipcode'])

0%    100%
[########] | ETA[sec]: 0.000
Total time elapsed: 0.005 sec
0%  100%
[]

Finding pairs with missing value...

In [28]:
output_pairs

    _id l_A.id r_B.id l_A.zipcode r_B.zipcode  _sim_score
0     0     a1     b1     94107.0     94107.0           0
1     1     a3     b1     94107.0     94107.0           0
2     2     a1     b2     94107.0     94107.0           0
3     3     a3     b2     94107.0     94107.0           0
4     4     a2     b3     94122.0     94122.0           0
5     5     a4     b3     94122.0     94122.0           0
6     6     a5     b3     94122.0     94122.0           0
7     7     a6     b3     94122.0     94122.0           0
8     8     a2     b4     94122.0     94122.0           0
9     9     a4     b4     94122.0     94122.0           0
10   10     a5     b4     94122.0     94122.0           0
11   11     a6     b4     94122.0     94122.0           0
12   12     a2     b5     94122.0     94122.0           0
13   13     a4     b5     94122.0     94122.0           0
14   14     a5     b5     94122.0     94122.0           0
15   15     a6     b5     94122.0     94122.0           0
16   16     a1     b6     94107.0     94107.0           0
17   17     a3     b6     94107.0     94107.0           0
18   18     a2     b7     94122.0     94122.0           0
19   19     a4     b7     94122.0     94122.0           0
20   20     a5     b7     94122.0     94122.0           0
21   21     a6     b7     94122.0     94122.0           0
22   22     a7     b8         nan         nan           0

# Enabling parallel processing

If you have multiple cores which you want to exploit for performing the join, you need to use the **n_jobs** option. If n_jobs is -1, all CPUs are used. If 1 is given, no parallel computing code is used at all, which is useful for debugging and is the default option. For n_jobs below -1, (n_cpus + 1 + n_jobs) are used. Thus for n_jobs = -2, all CPUs but one are used. The below command exploits all the cores available to perform the join:

In [19]:
output_pairs = ssj.jaccard_join(A, B, 'A.id', 'B.id', 'A.name', 'B.name', ws, 0.3, 
                                l_out_attrs=['A.name'], r_out_attrs=['B.name'], n_jobs=-1)

0%  100%
[ ]

In [20]:
len(output_pairs)

5

# Additional options

You can find all the options available for the join function using the help command as shown below:

In [15]:
help(ssj.edit_distance_join)

Help on function edit_distance_join in module py_stringsimjoin.join.edit_distance_join:

edit_distance_join(ltable, rtable, l_key_attr, r_key_attr, l_join_attr, r_join_attr, threshold, comp_op='<=', allow_missing=False, l_out_attrs=None, r_out_attrs=None, l_out_prefix='l_', r_out_prefix='r_', out_sim_score=True, n_jobs=1, show_progress=True, tokenizer=<py_stringmatching.tokenizer.qgram_tokenizer.QgramTokenizer object>)
    Join two tables using edit distance measure.

    Finds tuple pairs from left table and right table such that the edit
    distance between the join attributes satisfies the condition on input
    threshold. That is, if the comparison operator is '<=', finds tuples pairs
    whose edit distance on the join attributes is less than or equal to the
    input threshold.

    Note:
        Currently, this method only computes an approximate join result. This is
        because, to perform the join we transform a edit distance measure
        between strings into an overlap measure between qgrams of the strings.
        Hence, we need atleast one qgram to be in common between two input
        strings, to appear in the join output. For smaller strings, where all
        qgrams of the strings differ, we cannot process them.

    Args:
        ltable (dataframe): left input table.

        rtable (dataframe): right input table.

        l_key_attr (string): key attribute in left table.

        r_key_attr (string): key attribute in right table.

        l_join_attr (string): join attribute in left table.

        r_join_attr (string): join attribute in right table.

        threshold (float): edit distance threshold to be satisfied.

        comp_op (string): comparison operator. Supported values are '<=', '<'
            and '=' (defaults to '<=').

        allow_missing (boolean): flag to indicate whether tuple pairs with
            missing value in at least one of the join attributes should be
            included in the output (defaults to False). If this flag is set to
            True, a tuple in ltable with missing value in the join attribute
            will be matched with every tuple in rtable and vice versa.

        l_out_attrs (list): list of attribute names from the left table to be
            included in the output table (defaults to None).

        r_out_attrs (list): list of attribute names from the right table to be
            included in the output table (defaults to None).

        l_out_prefix (string): prefix to be used for the attribute names coming
            from the left table, in the output table (defaults to 'l\_').

        r_out_prefix (string): prefix to be used for the attribute names coming
            from the right table, in the output table (defaults to 'r\_').

        out_sim_score (boolean): flag to indicate whether the edit distance
            score should be included in the output table (defaults to True).
            Setting this flag to True will add a column named '_sim_score' in
            the output table. This column will contain the edit distance scores
            for the tuple pairs in the output.

        n_jobs (int): number of parallel jobs to use for the computation
            (defaults to 1). If -1 all CPUs are used. If 1 is given, no
            parallel computing code is used at all, which is useful for
            debugging. For n_jobs below -1, (n_cpus + 1 + n_jobs) are used. Thus
            for n_jobs = -2, all CPUs but one are used. If (n_cpus + 1 + n_jobs)
            becomes less than 1, then n_jobs is set to 1.

        show_progress (boolean): flag to indicate whether task progress should
            be displayed to the user (defaults to True).

        tokenizer (Tokenizer object): tokenizer to be used to tokenize the join
            attributes during filtering, when edit distance measure is
            transformed into an overlap measure. This must be a q-gram tokenizer
            (defaults to 2-gram tokenizer).

    Returns:
        An output table containing tuple pairs that satisfy the join
        condition (dataframe).